{
    "kamis": [
        {
            "id": 0,
            "kamiName": "Ametarasu",
            "dialogs": [
                "Citizens of Dalaran! Raise your eyes to the skies and observe! Today our world's destruction has been averted in defiance of our very makers!",
                "Algalon the Observer, herald of the titans, has been defeated by our brave comrades in the depths of the titan city of Ulduar.",
                "Algalon was sent here to judge the fate of our world. He found a planet whose races had deviated from the titans' blueprints. A planet where not everything had gone according to plan.",
                "Cold logic deemed our world not worth saving. Cold logic, however, does not account for the power of free will. It's up to each of us to prove this is a world worth saving. That our lives... our lives are worth living."
            ],
            "puzzleText": "20 süße Kitsune verwandeln sich jeden Samstag in Menschen und genießen zusammen die in ihrem Schrein erbrachten Opfergaben. Diesmal tranken 10 von ihnen guten Sake, 15 aßen leckeren Reis und 3 von ihnen wollten sich lediglich unterhalten. Wie viele der Kitsune aßen Reis und tranken dazu Sake?",
            "puzzleAnswer": "20"
        },
        {
            "id": 1,
            "kamiName": "Susanno",
            "dialogs": [
                "My son, the day you were born, the very forests of Lordaeron whispered the name Arthas.",
                "My child, I watched with pride as you grew into a weapon of righteousness.",
                "Remember, our line has always ruled with wisdom and strength.",
                "And I know you will show restraint when exercising your great power.",
                "But the truest victory, my son, is stirring the hearts of your people. I tell you this, for when my days have come to an end, you shall be King."
            ],
            "puzzleText": "Beim Besuch ihres Hauptschreines Fushimi Inari-Taisha in Kyoto schaut sich Inari die an sie gerichteten Kiganbun (Wunsch-Briefe) an, als die Kitsune ihr plötzlich aufgeregt zurufen, dass eines der Schriftstücke vor ihr ein besonders schöner Liebesbrief ist. Um welchen davon handelt es sich wohl?",
            "puzzleAnswer": "2"
        }
    ]
}