{
    "kamis": [
        {
            "id": 0,
            "kamiName": "Ametarasu",
            "dialogs": [
                "Citizens of Dalaran! Raise your eyes to the skies and observe! Today our world's destruction has been averted in defiance of our very makers!",
                "Algalon the Observer, herald of the titans, has been defeated by our brave comrades in the depths of the titan city of Ulduar.",
                "Algalon was sent here to judge the fate of our world. He found a planet whose races had deviated from the titans' blueprints. A planet where not everything had gone according to plan.",
                "Cold logic deemed our world not worth saving. Cold logic, however, does not account for the power of free will. It's up to each of us to prove this is a world worth saving. That our lives... our lives are worth living.",
                "Do you want to start a puzzle?"
            ],
            "puzzleText": "20 süße Kitsune verwandeln sich jeden Samstag in Menschen und genießen zusammen die in ihrem Schrein erbrachten Opfergaben. Diesmal tranken 10 von ihnen guten Sake, 15 aßen leckeren Reis und 3 von ihnen wollten sich lediglich unterhalten. Wie viele der Kitsune aßen Reis und tranken dazu Sake?",
            "puzzleAnswer": "20",
            "dialogsAfterPuzzle": [
                "Did you think we had forgotten? Did you think we had forgiven?",
                "Behold, now, the terrible vengeance of the Forsaken!",
                "Death to the Scourge! And death to the living!",
                "Now, all can see... this is the hour of the Forsaken."
            ]
        },
        {
            "id": 1,
            "kamiName": "Susanno",
            "dialogs": [
                "My son, the day you were born, the very forests of Lordaeron whispered the name Arthas.",
                "My child, I watched with pride as you grew into a weapon of righteousness.",
                "Remember, our line has always ruled with wisdom and strength.",
                "And I know you will show restraint when exercising your great power.",
                "But the truest victory, my son, is stirring the hearts of your people. I tell you this, for when my days have come to an end, you shall be King."
            ],
            "puzzleText": "Beim Besuch ihres Hauptschreines Fushimi Inari-Taisha in Kyoto schaut sich Inari die an sie gerichteten Kiganbun (Wunsch-Briefe) an, als die Kitsune ihr plötzlich aufgeregt zurufen, dass eines der Schriftstücke vor ihr ein besonders schöner Liebesbrief ist. Um welchen davon handelt es sich wohl?",
            "puzzleAnswer": "2",
            "dialogsAfterPuzzle": [
                "Don't look so smug! I know what you're thinking, but Tempest Keep was merely a set back.",
                "Did you honestly believe I would trust the future to some blind, half-night elf mongrel?",
                "Oh no, he was merely an instrument, a stepping stone to a much larger plan! It has all led to this... and this time you will not interfere!"
            ]
        },
        {
            "id": 2,
            "kamiName": "Amabie",
            "dialogs": [
                "I'm Amabie, the beautiful queen of harvest and pandemics. Since the last big pandemic finally the small humans understand my value!",
                "However, no one takes care of the harvest anymore. The stupid humans pretend to have other problems.",
                "But you, little thing, look like you know what you are doing. Offer me some tasty apples to stop this pandemic!"
            ],
            "puzzleText": "Bla bla bla Mr. Freeman",
            "puzzleAnswer": "2",
            "dialogsAfterPuzzle": [
                "Don't look so smug! Did you really thought that you small human can stop a world wide pandemic? Muhahaha",
                "Nevertheless, I will reward your efforts. Go to Susanno's shrine and help this old bastard to restore the balance in this world. At least a bit ;)"
            ]
		},
         {
            "id": 3,
            "kamiName": "Kappa",
            "dialogs": [
                "I'm Kappa"
            ],
            "puzzleText": "You have one 16 litre pitcher full of water, one empty 9 litre pitcher, and one empty 7 litre pitcher. Using nothing but these three pitchers, can you divide the water evenly so that the 16 and 9 litre pitchers are each holding exactly 8 litres of water?",
            "puzzleAnswer": "2",
            "dialogsAfterPuzzle": [
                "Don't look so smug! Did you really thought that you small human can stop a world wide pandemic? Muhahaha",
                "Nevertheless, I will reward your efforts. Go to Susanno's shrine and help this old bastard to restore the balance in this world. At least a bit ;)"
            ]
		}
    ]
}